# UJIAN TENGAH SEMESTER DATA WAREHOUSE
**Anggota Kelompok:**
- Amir Salim - 140810210015
- Muhammad Giat - 140810210013
- Aryan Dafi Maulana - 140810210012
- Varian Avila Faldi - 140810210055

### Import Library yang Digunakan

In [78]:
# Input semua library yang dibutuhkan

import pandas as pd

### Gathering Data

In [79]:
# Read dataset gudang_philip.csv
table_gudang_p_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/gudang_philip.csv')
table_gudang_p_df.head()

   GudangID     Negara       Kota  Kapasitas (Ton)
0  PMI-W001  Indonesia   Surabaya          25000.0
1  PMI-W002      Rusia     Moskow          20000.0
2  PMI-W003     Jerman    Hamburg          18000.0
3  PMI-W004     Italia     Napoli          15000.0
4  PMI-W005    Spanyol  Barcelona          22000.0

In [80]:
# Read dataset gudang_altria.csv
table_gudang_al_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/gudang_altria.csv')
table_gudang_al_df.head()

   GudangID   Negara Bagian          Kota  Kapasitas (Ton)
0  ALT-W001        Virginia       Norfolk            12000
1  ALT-W002    Pennsylvania  Philadelphia            10000
2  ALT-W003        Illinois        Joliet             8000
3  ALT-W004  North Carolina    Greensboro            14000
4  ALT-W005        Kentucky     Lexington            11000

In [81]:
# Read dataset pabrik_philip.csv
table_pabrik_p_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/pabrik_philip.csv')
table_pabrik_p_df.head()

   PabrikID     Negara            Kota  KapasitasProduksi (Ton/Tahun)
0  PMI-F001  Indonesia        Karawang                         150000
1  PMI-F002      Rusia  St. Petersburg                         120000
2  PMI-F003     Jerman          Berlin                         100000
3  PMI-F004     Italia         Bologna                          80000
4  PMI-F005    Spanyol          Madrid                          90000

In [82]:
# Read dataset pabrik_altria.csv
table_pabrik_al_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/pabrik_altria.csv')
table_pabrik_al_df.head()

   PabrikID   Negara Bagian           Kota  KapasitasProduksi (Ton/Tahun)
0  ALT-F001        Virginia       Richmond                          60000
1  ALT-F002    Pennsylvania   Wilkes-Barre                          50000
2  ALT-F003        Illinois        Chicago                          40000
3  ALT-F004  North Carolina  Winston-Salem                          55000
4  ALT-F005        Kentucky     Louisville                          45000

In [83]:
# Read dataset transaksi_philip.csv
table_transaksi_p_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/transaksi_philip.csv')
table_transaksi_p_df.head()

  TransaksiID  Tahun     Negara  JumlahProduk  TotalPenjualan (USD)  GudangID
0    PMI-T001   2022  Indonesia       2500000             250000000  PMI-W001
1    PMI-T002   2022      Rusia       1800000             180000000  PMI-W002
2    PMI-T003   2022     Jerman       1200000             120000000  PMI-W003
3    PMI-T004   2022     Italia       1000000             100000000  PMI-W004
4    PMI-T005   2022    Spanyol       1500000             150000000  PMI-W005

In [84]:
# Read dataset transaksi_altria.csv
table_transaksi_al_df = pd.read_csv('https://raw.githubusercontent.com/mhmmadgiatt/Data-warehouse/main/transaksi_altria.csv')
table_transaksi_al_df.head()

,TransaksiID,Tahun,Negara Bagian,JumlahProduk,TotalPenjualan (USD),GudangID
0,ALT-T001,2022,Virginia,1000000,100000000,ALT-W001
1,ALT-T002,2022,Pennsylvania,800000,80000000,ALT-W002
2,ALT-T003,2022,Illinois,600000,60000000,ALT-W003
3,ALT-T004,2022,North Carolina,900000,90000000,ALT- W004
4,ALT-T005,2022,Kentucky,700000,70000000,ALT-W005

### Cleaning Data
##### Pada tahap cleaning kita akan melakukan beberapa tahapan agar data lebih mudah dipahami dan lebih bersih untuk diolah
- Menghapus Data Duplicate

In [85]:
# Check for duplicate data table_gudang_p_df
duplicate_gudang_p = table_gudang_p_df.duplicated()

# Print how many duplicates are in table_gudang_p_df
print("Jumlah data duplikat pada tabel Gudang Philip: ", duplicate_gudang_p.sum())

Jumlah data duplikat pada tabel Gudang Philip:  4

In [86]:
# Delete duplicate data table_gudang_p_df
table_gudang_p_df = table_gudang_p_df.drop_duplicates()

# Success message
print("Duplicates removed successfully!")

Duplicates removed successfully!

In [87]:
# Print sum of duplicates
print("Jumlah data duplikat pada tabel Gudang Philip: ", table_gudang_p_df.duplicated().sum())

Jumlah data duplikat pada tabel Gudang Philip:  0

In [88]:
# Print how many duplicates are in table_pabrik_al_df
print("Jumlah data duplikat pada tabel pabrik Altria: ", table_pabrik_al_df.duplicated().sum())

Jumlah data duplikat pada tabel pabrik Altria:  5

In [89]:
# Delete duplicates
table_pabrik_al_df = table_pabrik_al_df.drop_duplicates()

# Success message
print("Duplicates removed successfully!")

Duplicates removed successfully!

In [90]:
# Print sum of duplicates
print ( "Jumlah data duplikat yang tersisa: ", table_pabrik_al_df.duplicated().sum())

Jumlah data duplikat yang tersisa:  0

- Missing value
###### Untuk mengatasi missing value baris dari data akan di drop

In [91]:
# Check missing values in table_gudang_p_df
missing_values = table_gudang_p_df.isnull().sum()

# Print missing values in table_gudang_p_df
print("Jumlah data yang hilang pada tabel Gudang Philip: ", missing_values.sum())

Jumlah data yang hilang pada tabel Gudang Philip:  8

In [92]:
# Drop missing values
table_gudang_p_df = table_gudang_p_df.dropna()

# Success message
print("Data hilang berhasil dihapus!")

Data hilang berhasil dihapus!

In [93]:
# Print sum of missing values
print("Jumlah data yang hilang yang tersisa: ", table_gudang_p_df.isnull().sum().sum())

Jumlah data yang hilang yang tersisa:  0

- Mengubah nama kolom pada tabel Gudang, Pabrik, dan Transaksi

In [94]:
# Rename column 'Negara Bagian' to 'Negara'
table_gudang_al_df = table_gudang_al_df.rename(columns={'Negara Bagian': 'Negara'})
table_pabrik_al_df = table_pabrik_al_df.rename(columns={'Negara Bagian': 'Negara'})
table_transaksi_al_df = table_transaksi_al_df.rename(columns={'Negara Bagian': 'Negara'})

# Success message
print("Nama kolom berhasil diubah!")

Nama kolom berhasil diubah!

### Integrasi Data
- Menggabungkan Dataset untuk Tabel Gudang, Pabrik, dan Transaksi

In [95]:
# Merge table_gudang_p_df and table_gudang_al_df
gudang_df = pd.concat([table_gudang_p_df, table_gudang_al_df])

# Merge table_pabrik_p_df and table_pabrik_al_df
pabrik_df = pd.concat([table_pabrik_p_df, table_pabrik_al_df])

# Merge table_transaksi_p_df and table_transaksi_al_df
transaksi_df = pd.concat([table_transaksi_p_df, table_transaksi_al_df])

# Success message
print("Data berhasil digabungkan!")

Data berhasil digabungkan!

In [96]:
# Show merged data table_gudang_p_df and table_gudang_al_df
print(gudang_df)

    GudangID                Negara             Kota  Kapasitas (Ton)
0   PMI-W001             Indonesia         Surabaya          25000.0
1   PMI-W002                 Rusia           Moskow          20000.0
2   PMI-W003                Jerman          Hamburg          18000.0
3   PMI-W004                Italia           Napoli          15000.0
4   PMI-W005               Spanyol        Barcelona          22000.0
..       ...                   ...              ...              ...
95  ALT-W096         West Virginia       Huntington             70.0
96  ALT-W097        South Carolina       Greenville             60.0
97  ALT-W098                Hawaii       Pearl City             50.0
98  ALT-W099                Alaska        Fairbanks             40.0
99  ALT-W100  District of Columbia  Washington D.C.             30.0

[186 rows x 4 columns]

In [97]:
# Show merged data table_pabrik_p_df and table_pabrik_al_df
print(pabrik_df)

     PabrikID          Negara            Kota  KapasitasProduksi (Ton/Tahun)
0    PMI-F001       Indonesia        Karawang                         150000
1    PMI-F002           Rusia  St. Petersburg                         120000
2    PMI-F003          Jerman          Berlin                         100000
3    PMI-F004          Italia         Bologna                          80000
4    PMI-F005         Spanyol          Madrid                          90000
..        ...             ...             ...                            ...
98   ALT-F096        Delaware           Dover                             40
99   ALT-F097   West Virginia      Huntington                             30
100  ALT-F098  South Carolina      Greenville                             20
101  ALT-F099          Hawaii      Pearl City                             15
102  ALT-F100          Alaska       Fairbanks                             10

[199 rows x 4 columns]

In [98]:
# Show merged data table_transaksi_p_df and table_transaksi_al_df
print(transaksi_df)

   TransaksiID  Tahun                Negara  JumlahProduk  \
0     PMI-T001   2022             Indonesia       2500000
1     PMI-T002   2022                 Rusia       1800000
2     PMI-T003   2022                Jerman       1200000
3     PMI-T004   2022                Italia       1000000
4     PMI-T005   2022               Spanyol       1500000
..         ...    ...                   ...           ...
95    ALT-T096   2022         West Virginia          7000
96    ALT-T097   2022        South Carolina          6000
97    ALT-T098   2022                Hawaii          5000
98    ALT-T099   2022                Alaska          4000
99    ALT-T100   2022  District of Columbia          3000

    TotalPenjualan (USD)  GudangID
0              250000000  PMI-W001
1              180000000  PMI-W002
2              120000000  PMI-W003
3              100000000  PMI-W004
4              150000000  PMI-W005
..                   ...       ...
95                700000  ALT-W096
96                600000  ALT-W097
97                500000  ALT-W098
98                400000  ALT-W099
99                300000  ALT-W100

[200 rows x 6 columns]

### Transformasi Data
- Mencari Tahu Transaksi Terbesar dan Terkecil di Gudang

In [99]:
# Merge the transaction and warehouse data based on GudangID
merged_data = pd.merge(transaksi_df, gudang_df, on='GudangID')

# Find the largest transaction
largest_transaction = merged_data[merged_data['JumlahProduk'] == merged_data['JumlahProduk'].max()]

# Print the largest transaction
print("Transaksi Terbesar: ""\n""\n", largest_transaction)

Transaksi Terbesar:

    TransaksiID  Tahun         Negara_x  JumlahProduk  TotalPenjualan (USD)  \
68    PMI-T073   2022  Amerika Serikat       3000000             300000000

    GudangID         Negara_y     Kota  Kapasitas (Ton)
68  PMI-W073  Amerika Serikat  Chicago          25000.0

In [100]:
#Find the fewest transactions
fewest_transaction = merged_data[merged_data['JumlahProduk'] == merged_data['JumlahProduk'].min()]

# Print fewest transaction
print("Transaksi Terkecil: ""\n""\n", fewest_transaction)

Transaksi Terkecil:

     TransaksiID  Tahun              Negara_x  JumlahProduk  \
184    ALT-T100   2022  District of Columbia          3000

     TotalPenjualan (USD)  GudangID              Negara_y             Kota  \
184                300000  ALT-W100  District of Columbia  Washington D.C.

     Kapasitas (Ton)
184             30.0

- Mencari Tahu Kapasitas Terbesar dan Terkecil Gudang

In [101]:
# Find largest warehouse capacity
kapasitas_terbesar = gudang_df["Kapasitas (Ton)"].max()

# Find smallest warehouse capacity
kapasitas_terkecil = gudang_df["Kapasitas (Ton)"].min()

print("Kapasitas Gudang Terbesar:", kapasitas_terbesar) 
print("Kapasitas Gudang Terkecil:", kapasitas_terkecil)

Kapasitas Gudang Terbesar: 25000.0
Kapasitas Gudang Terkecil: 30.0